fix quick udpate status bug in installer
